[
  {
    "item_id": 1000,
    "name": "Water",
    "type": "RESOURCE",
    "grid_index": 1107,
    "stack_size": 20,
    "is_fluid": true,
    "unlock_key": 2306,
    "mining_from": "Ocean",
    "description": "It is obtained from using the Water Pump, widely used in chemical production. It can also be used as throwable item to practice but it has no damage or effect."
  },
  {
    "item_id": 1001,
    "name": "Iron Ore",
    "type": "RESOURCE",
    "grid_index": 1101,
    "stack_size": 100,
    "unlock_key": -1,
    "mining_from": "Iron Veins",
    "description": "It is collected from mining the iron veins and used for smelting iron ingots and magnets."
  },
  {
    "item_id": 1002,
    "name": "Copper Ore",
    "type": "RESOURCE",
    "grid_index": 1102,
    "stack_size": 100,
    "unlock_key": -1,
    "mining_from": "Copper Veins",
    "description": "It is collected from mining the copper veins and can be smelted directly into copper ingots."
  },
  {
    "item_id": 1003,
    "name": "Silicon Ore",
    "type": "RESOURCE",
    "grid_index": 1105,
    "stack_size": 100,
    "unlock_key": 6001,
    "mining_from": "Silicon Veins",
    "description": "It is a high-purity silicon ore harvested from mining the silicon veins. It is used to make high-purity silicon."
  },
  {
    "item_id": 1004,
    "name": "Titanium Ore",
    "type": "RESOURCE",
    "grid_index": 1106,
    "stack_size": 100,
    "unlock_key": 6002,
    "mining_from": "Titanium Veins",
    "description": "It is a type of ore with a unique molecular structure created under intense heat."
  },
  {
    "item_id": 1005,
    "name": "Stone",
    "type": "RESOURCE",
    "grid_index": 1103,
    "stack_size": 100,
    "unlock_key": -1,
    "mining_from": "Stone Veins",
    "description": "It is a common type of ore and an important raw material for production. It can also be harvested from rocks."
  },
  {
    "item_id": 1006,
    "name": "Coal",
    "type": "RESOURCE",
    "grid_index": 1104,
    "stack_size": 100,
    "energy": 2700000,
    "fuel_chamber_boost": 0.0,
    "unlock_key": -1,
    "mining_from": "Coal Veins",
    "description": "It is a solid combustible ore. It is gradually formed by plants through complex physiological and bio-mechanical changes. It is an energy source and a vital raw material for smelting and chemical production."
  },
  {
    "item_id": 1007,
    "name": "Crude Oil",
    "type": "RESOURCE",
    "grid_index": 1108,
    "stack_size": 20,
    "is_fluid": true,
    "energy": 4050000,
    "fuel_chamber_boost": 0.2,
    "unlock_key": 2307,
    "mining_from": "Crude Oil Seep",
    "description": "It is a type of fossil formed from marine organisms and can be mined as a liquid mineral. It contains chemical energy stored within marine organisms during their life-time, and can be used as fuel or as a raw chemical material."
  },
  {
    "item_id": 1011,
    "name": "Fire Ice",
    "type": "RESOURCE",
    "grid_index": 1614,
    "stack_size": 50,
    "energy": 4800000,
    "fuel_chamber_boost": 0.4,
    "unlock_key": 1120,
    "mining_from": "Fire ice vein &lt;span style=\"color:#FFFFFFC1\"&gt;(rare)&lt;/span&gt;",
    "description": "It is a rare ore and an ice-like white solid matter having cage-like micro-structures. Its covalent bonds are at a critical state, which make them the ideal material for more efficient graphene production."
  },
  {
    "item_id": 1012,
    "name": "Kimberlite Ore",
    "type": "RESOURCE",
    "grid_index": 1114,
    "stack_size": 50,
    "unlock_key": 1112,
    "mining_from": "Kimberlite vein &lt;span style=\"color:#B9DFFFC4\"&gt;(rare)&lt;/span&gt;",
    "description": "It is a rare ore formed and crystallized directly from kimberlite magmas under CO₂-rich conditions. Smelting it yield diamonds."
  },
  {
    "item_id": 1013,
    "name": "Fractal Silicon",
    "type": "RESOURCE",
    "grid_index": 1214,
    "stack_size": 50,
    "unlock_key": 1105,
    "mining_from": "Fractal silicium vein &lt;span style=\"color:#43FF89D4\"&gt;(rare)&lt;/span&gt;",
    "description": "It is a rare natural silicon ore with a unique geometric fractal structure. When a single crystal grows to a certain size, it is notable that a small twig of silicon crystals grow out of the matrix. Crystal fractalization is a natural occurring process. The higher in fractal generations, the greater in purity. Fractal silicon with more than six fractal generations can be used directly as a raw material for producing crystal silicon."
  },
  {
    "item_id": 1014,
    "name": "Grating Crystal",
    "type": "RESOURCE",
    "grid_index": 1314,
    "stack_size": 50,
    "unlock_key": 6002,
    "mining_from": "Grating Crystal vein &lt;span style=\"color:#E37AFFDA\"&gt;(rare)&lt;/span&gt;",
    "description": "It is a rare ore with naturally formed grooves distributed across the surface. It is used to produce precision optical components and high-power exciters."
  },
  {
    "item_id": 1015,
    "name": "Stalagmite Crystal",
    "type": "RESOURCE",
    "grid_index": 1414,
    "stack_size": 50,
    "unlock_key": 6002,
    "mining_from": "Stalagmite Crystal Vein &lt;span style=\"color:#7AF0FFC8\"&gt;(rare)&lt;/span&gt;",
    "description": "They were rare creatures that once widely existed on this living planet in the ocean at a depth of 100,000 meters. After the marine life on these planets die, their bodies sink to the bottom of the ocean, and mineralize with seawater under the deep pressure of the ocean. If there is a stable, smooth, slow and hot ocean current, stalagmite crystals may form as a result of this occurrence."
  },
  {
    "item_id": 1016,
    "name": "Unipolar Magnet",
    "type": "RESOURCE",
    "grid_index": 1514,
    "stack_size": 50,
    "unlock_key": 1206,
    "mining_from": "Unipolar magnet vein &lt;span style=\"color:#FFA086C8\"&gt;(rare)&lt;/span&gt;",
    "description": "It is a rare ore with a pyrochlore lattice. In order to separate the \"magnetic monopoles\", a magnetic field can be applied to affect the symmetry and orientation of the string by lowering the density of the string network."
  },
  {
    "item_id": 1030,
    "name": "Log",
    "type": "RESOURCE",
    "grid_index": 1714,
    "stack_size": 100,
    "energy": 1500000,
    "fuel_chamber_boost": -0.1,
    "unlock_key": -1,
    "mining_from": "Tree",
    "description": "It is a normal fuel that has a lower energy and is collected from trees,"
  },
  {
    "item_id": 1031,
    "name": "Plant Fuel",
    "type": "RESOURCE",
    "grid_index": 1814,
    "stack_size": 500,
    "energy": 500000,
    "fuel_chamber_boost": -0.3,
    "unlock_key": -1,
    "mining_from": "Plant",
    "description": "It contains lower energy compared to wood, but it is easier to harvest."
  },
  {
    "item_id": 1099,
    "name": "Soil Pile",
    "type": "RESOURCE",
    "grid_index": 0,
    "stack_size": 1000000,
    "description": "",
    "disabled": true
  },
  {
    "item_id": 1101,
    "name": "Iron Ingot",
    "type": "MATERIAL",
    "grid_index": 1201,
    "stack_size": 100,
    "description": "It is a basic raw material used to produce various iron components."
  },
  {
    "item_id": 1102,
    "name": "Magnet",
    "type": "MATERIAL",
    "grid_index": 1301,
    "stack_size": 200,
    "description": "It is a basic magnetic material obtained directly by smelting iron ores."
  },
  {
    "item_id": 1103,
    "name": "Steel",
    "type": "MATERIAL",
    "grid_index": 1401,
    "stack_size": 100,
    "description": "Iron ingots as raw materials are smelted under strict temperature control to improve the crystal structure of the materials, and yield a higher mechanical properties."
  },
  {
    "item_id": 1104,
    "name": "Copper Ingot",
    "type": "MATERIAL",
    "grid_index": 1202,
    "stack_size": 100,
    "description": "It is a basic raw material used to produce various copper components."
  },
  {
    "item_id": 1105,
    "name": "High-Purity Silicon",
    "type": "MATERIAL",
    "grid_index": 1205,
    "stack_size": 100,
    "description": "After melting and re-crystallization of the crude silicon, analytically pure silicon crystals are formed. The photovoltaic materials and semiconductor components made from them can fulfill a variety of needs."
  },
  {
    "item_id": 1106,
    "name": "Titanium Ingot",
    "type": "MATERIAL",
    "grid_index": 1206,
    "stack_size": 100,
    "description": "Obtained from smelting titanium ores, it is light in weight and highly dense, making it an essential raw material for producing high-density materials."
  },
  {
    "item_id": 1107,
    "name": "Titanium Alloy",
    "type": "MATERIAL",
    "grid_index": 1306,
    "stack_size": 100,
    "description": "Utilizing the uniqueness of the lattice structure in titanium at different temperatures, adding precise and proportional amount of alloying elements can achieve the perfect balance of phase transition temperature and phase content, resulting a new type of alloy material with superior strength and density."
  },
  {
    "item_id": 1108,
    "name": "Stone Brick",
    "type": "MATERIAL",
    "grid_index": 1203,
    "stack_size": 100,
    "description": "It is a common material obtained by smelting stones and used to produce the foundation of the facilities."
  },
  {
    "item_id": 1109,
    "name": "Energetic Graphite",
    "type": "MATERIAL",
    "grid_index": 1204,
    "stack_size": 100,
    "energy": 6750000,
    "fuel_chamber_boost": 0.5,
    "explicit_tech_dep": 1402,
    "description": "Impurities such as hydrogen in coal is directly removed from the ion current, followed by a compaction process to yield crystalline graphite that has superior application performance."
  },
  {
    "item_id": 1110,
    "name": "Glass",
    "type": "MATERIAL",
    "grid_index": 1303,
    "stack_size": 100,
    "description": "It is an irregularly structured amorphous optical medium. It can be used to make various optical components such as prisms and lenses, and it can also be used to build a variety of facilities."
  },
  {
    "item_id": 1111,
    "name": "Prism",
    "type": "MATERIAL",
    "grid_index": 1403,
    "stack_size": 100,
    "description": "It is a polyhedron surrounded by two intersecting glass planes. It splits light or disperses light beams, making it a key component for producing more precise optical instruments."
  },
  {
    "item_id": 1112,
    "name": "Diamond",
    "type": "MATERIAL",
    "grid_index": 1304,
    "stack_size": 100,
    "energy": 900000,
    "fuel_chamber_boost": -0.5,
    "description": "Diamonds are formed by using extreme high pressure and heat to alter the structure of graphite. Not only does it preserve the parallel hexagonal lattice of graphite but also form a cubic hexagonal lattice, and it is a very hard crystal."
  },
  {
    "item_id": 1113,
    "name": "Crystal Silicon",
    "type": "MATERIAL",
    "grid_index": 1305,
    "stack_size": 100,
    "explicit_tech_dep": 1403,
    "description": "Melting high-purity silicon and passing it through a strong electric field at a certain speed will yield a spectrally pure silicon crystal. This process can further remove any dissolved ionic impurities. Lattice silicon is almost free of crystal defects, and so it is primarily used to produce ultra-high-precision optical instruments."
  },
  {
    "item_id": 1114,
    "name": "Refined Oil",
    "type": "MATERIAL",
    "grid_index": 1208,
    "stack_size": 20,
    "is_fluid": true,
    "energy": 4500000,
    "fuel_chamber_boost": 0.3,
    "description": "It is a primary product of crude oil refining. It is a chemical fuel used to manufacture various chemical products."
  },
  {
    "item_id": 1115,
    "name": "Plastic",
    "type": "MATERIAL",
    "grid_index": 1308,
    "stack_size": 100,
    "description": "It is a primary chemical product, which is highly versatile. It is used to make more advanced chemical products."
  },
  {
    "item_id": 1116,
    "name": "Sulfuric Acid",
    "type": "MATERIAL",
    "grid_index": 1207,
    "stack_size": 20,
    "is_fluid": true,
    "mining_from": "Sulfuric acid ocean",
    "description": "It is a primary chemical product of crude oil. It can be directly obtained from the sulfuric acid ocean using a water pump."
  },
  {
    "item_id": 1117,
    "name": "Organic Crystal",
    "type": "MATERIAL",
    "grid_index": 1309,
    "stack_size": 100,
    "energy": 1800000,
    "fuel_chamber_boost": -0.2,
    "mining_from": "Organic crystal vein &lt;span style=\"color:#F5FF4FC1\"&gt;(rare)&lt;/span&gt;",
    "description": "It is a high-graded chemical product of crude oil with crystal structure. It can also be sourced directly from rare organic crystal veins, and it is used to produce crystals with higher density."
  },
  {
    "item_id": 1118,
    "name": "Titanium Crystal",
    "type": "MATERIAL",
    "grid_index": 1409,
    "stack_size": 100,
    "description": "Adding precise, proportional organic crystals in titanium can further strengthen its lattice structure, forming special titanium atomic crystals with greater density."
  },
  {
    "item_id": 1119,
    "name": "Titanium Glass",
    "type": "MATERIAL",
    "grid_index": 1509,
    "stack_size": 100,
    "description": "Blending a proportional amount of titanium into molten glass can greatly strengthen the glass to withstand hostile environments."
  },
  {
    "item_id": 1120,
    "name": "Hydrogen",
    "type": "MATERIAL",
    "grid_index": 1109,
    "stack_size": 20,
    "is_fluid": true,
    "energy": 9000000,
    "fuel_chamber_boost": 1.0,
    "explicit_tech_dep": 1102,
    "mining_from": "Gas Giant Orbit",
    "description": "The most abundant element in the universe and the lightest gas."
  },
  {
    "item_id": 1121,
    "name": "Deuterium",
    "type": "MATERIAL",
    "grid_index": 1110,
    "stack_size": 20,
    "is_fluid": true,
    "energy": 9000000,
    "fuel_chamber_boost": 1.0,
    "unlock_key": 1120,
    "explicit_tech_dep": 1134,
    "mining_from": "Gas Giant Orbit",
    "description": "It is a stable isotope of hydrogen. Rarely found under natural conditions, most of them are from reprocessed hydrogen, or collected from the gas giants."
  },
  {
    "item_id": 1122,
    "name": "Antimatter",
    "type": "MATERIAL",
    "grid_index": 1111,
    "stack_size": 20,
    "description": "It is generated by inverting photons at a critical state. When Matter and Antimatter meet, they annihilate each other, and produce a massive burst of energy."
  },
  {
    "item_id": 1123,
    "name": "Graphene",
    "type": "MATERIAL",
    "grid_index": 1310,
    "stack_size": 100,
    "energy": 96000,
    "fuel_chamber_boost": -0.7,
    "description": "If one layer of graphene is laid on top of another layer of graphene, through rotation, the double-layer graphene will form a complex repeating structure - a superlattice. Upon rotation to a certain \"Magic Angle\", the double-layer graphene will become superconductive and become a new type of nano-superconducting material."
  },
  {
    "item_id": 1124,
    "name": "Carbon Nanotube",
    "type": "MATERIAL",
    "grid_index": 1410,
    "stack_size": 100,
    "energy": 84000,
    "fuel_chamber_boost": -0.8,
    "description": "It is very lightweight, and has a precisely interconnected hexagonal lattice structure. Such structure imparts exceptional strength and an impressive resistance to deformation, so it is ideally suited for the production of high-performance apparatuses."
  },
  {
    "item_id": 1125,
    "name": "Frame Material",
    "type": "MATERIAL",
    "grid_index": 1709,
    "stack_size": 100,
    "description": "It is a new type of high-density, lightweight structure. It is more resistant to the strong gravitational pull of stars than traditional structural materials, making it ideal for building Dyson Sphere components."
  },
  {
    "item_id": 1126,
    "name": "Casimir Crystal",
    "type": "MATERIAL",
    "grid_index": 1508,
    "stack_size": 100,
    "description": "The ion trap’s electric field holds charged particles in place, and Coulomb repulsion between the particles causes them to spontaneously form a spatial ring crystal. The zero-point energy of the particles inside the crystal can be stimulated by imposing a weak static magnetic field, resulting in a noticeable Casimir effect."
  },
  {
    "item_id": 1127,
    "name": "Strange Matter",
    "type": "MATERIAL",
    "grid_index": 1408,
    "stack_size": 100,
    "description": "Strange Matter carries great negative gravitational pressure that outweighs its energy density. This allows the space around it to warp and generates negative energy that the warp drive needs."
  },
  {
    "item_id": 1128,
    "name": "Combustible Unit",
    "type": "COMPONENT",
    "grid_index": 1307,
    "stack_size": 100,
    "energy": 9720000,
    "fuel_chamber_boost": 0.8,
    "description": "As a fuel, it can efficiently combust and generate enormous energy, while as an explosive component it can be used to craft shells and Explosive Units."
  },
  {
    "item_id": 1129,
    "name": "Explosive Unit",
    "type": "COMPONENT",
    "grid_index": 1407,
    "stack_size": 100,
    "energy": 21600000,
    "fuel_chamber_boost": 1.2,
    "description": "It is a powerful explosive crafted from Combustible Units. Sophisticated design and strict production control will ensure its optimal explosive capacity and stability. As a raw material used in the making of High-explosive Shell Sets, it offers powerful explosiveness and the ability to inflict heavy damage."
  },
  {
    "item_id": 1130,
    "name": "Crystal Explosive Unit",
    "type": "COMPONENT",
    "grid_index": 1507,
    "stack_size": 100,
    "energy": 54000000,
    "fuel_chamber_boost": 2.0,
    "description": "By inducing resonance of Casimir Crystals, its explosiveness is tremendously enhanced by a chainreaction-like effect in a small range."
  },
  {
    "item_id": 1131,
    "name": "Foundation",
    "type": "COMPONENT",
    "grid_index": 1706,
    "stack_size": 1000,
    "can_build": true,
    "build_index": 901,
    "description": "It is a terrain leveling tool. But it can’t be used to alter the planet's topography. You can only level the terrain to zero elevation. If the foundation is used for highlands, soil piles will be obtained. However, if the foundation is used for ocean or low-lying areas, soil piles will be consumed. When laying the Foundation, you can choose a decoration option or leave it plain and just level the terrain."
  },
  {
    "item_id": 1141,
    "name": "Proliferator Mk.I",
    "type": "MATERIAL",
    "grid_index": 1406,
    "stack_size": 200,
    "energy": 3240000,
    "fuel_chamber_boost": 0.3,
    "description": "Proliferator is input into the port above the Spray Coater and sprayed on cargo. When the sprayed cargo is used as raw materials to make the next-level products, it can yield extra products or speed up production. However, it will increase the power consumption for the entire production process."
  },
  {
    "item_id": 1142,
    "name": "Proliferator Mk.II",
    "type": "MATERIAL",
    "grid_index": 1506,
    "stack_size": 200,
    "energy": 8856000,
    "fuel_chamber_boost": 0.6,
    "description": "Compared to Proliferator MK.I, the Proliferator MK.II ingredient formula is upgraded. When cargo sprayed with Proliferator MK.II is used as raw materials to produce the next-level products, the extra products or production speedup effect can be dramatically improved."
  },
  {
    "item_id": 1143,
    "name": "Proliferator Mk.III",
    "type": "MATERIAL",
    "grid_index": 1606,
    "stack_size": 200,
    "energy": 21255000,
    "fuel_chamber_boost": 1.5,
    "description": "With a newly upgraded formula, when cargo sprayed with Proliferator MK.III is used as raw materials to produce the next-level products, it can help maximize the extra products and production speedup effect. However, the power consumption will increase during the production process, and it requires a higher-capacity production line."
  },
  {
    "item_id": 1201,
    "name": "Gear",
    "type": "COMPONENT",
    "grid_index": 1501,
    "stack_size": 200,
    "description": "It is a standard component deployed in a wide range of mechanical structures and used for transmission and other functions."
  },
  {
    "item_id": 1202,
    "name": "Magnetic Coil",
    "type": "COMPONENT",
    "grid_index": 1302,
    "stack_size": 200,
    "description": "It is an extremely useful basic electromagnetic component."
  },
  {
    "item_id": 1203,
    "name": "Electric Motor",
    "type": "COMPONENT",
    "grid_index": 1404,
    "stack_size": 100,
    "description": "It is a basic power system component that can improve mechanical performance."
  },
  {
    "item_id": 1204,
    "name": "Electromagnetic Turbine",
    "type": "COMPONENT",
    "grid_index": 1504,
    "stack_size": 100,
    "description": "It can defy gravity to levitate objects and is commonly used to create more advanced magnetic field generators."
  },
  {
    "item_id": 1205,
    "name": "Super-Magnetic Ring",
    "type": "COMPONENT",
    "grid_index": 1604,
    "stack_size": 100,
    "description": "It is a device to generate super magnetic fields. The resulting super-strong magnetic fields can work at the atomic scale directly and cause distortions in the material lattice, creating high-performance materials and devices."
  },
  {
    "item_id": 1206,
    "name": "Particle Container",
    "type": "COMPONENT",
    "grid_index": 1605,
    "stack_size": 100,
    "description": "It can cause particles to exhibit specific characteristics while firmly binding them."
  },
  {
    "item_id": 1208,
    "name": "Critical Photon",
    "type": "MATERIAL",
    "grid_index": 1113,
    "stack_size": 100,
    "unlock_key": 1122,
    "explicit_tech_dep": 1506,
    "explicit_produce_from": "Ray Receiver",
    "description": "It is a critical state photon that can be converted into Antimatter and hydrogen under the effect of a super magnetic field."
  },
  {
    "item_id": 1209,
    "name": "Graviton Lens",
    "type": "COMPONENT",
    "grid_index": 1705,
    "stack_size": 100,
    "description": "It is a piece of neutron star material encapsulated after processing. Its distorted and powerful gravitational field is shielded within. It is normally used to manipulate and change the spatial structure, but this does not stop some folks from using it to focus the sun’s rays and ignite a fire."
  },
  {
    "item_id": 1210,
    "name": "Space Warper",
    "type": "COMPONENT",
    "grid_index": 1704,
    "stack_size": 100,
    "explicit_tech_dep": 1704,
    "description": "It is a consumable item that activates warp flight for the mecha and Logistics Vessels.&lt;br /&gt;Use the &lt;span style=\"color:#FD965ECC\"&gt;CAPSLOCK&lt;/span&gt; key to activate the warp drive."
  },
  {
    "item_id": 1301,
    "name": "Circuit Board",
    "type": "COMPONENT",
    "grid_index": 1402,
    "stack_size": 200,
    "description": "It is a highly versatile basic electrical component."
  },
  {
    "item_id": 1302,
    "name": "Microcrystalline Component",
    "type": "COMPONENT",
    "grid_index": 1405,
    "stack_size": 200,
    "description": "It is a microcrystalline component, which is the basis for achieving high-speed computing functions in processors. Its production involves carving and fabricating \"city-like\" three-dimensional nanostructures on high-purity silicon wafers."
  },
  {
    "item_id": 1303,
    "name": "Processor",
    "type": "COMPONENT",
    "grid_index": 1505,
    "stack_size": 200,
    "description": "It is a large-scale integrated circuit device. Using semiconductor materials enables better data processing and processing control."
  },
  {
    "item_id": 1304,
    "name": "Plane Filter",
    "type": "COMPONENT",
    "grid_index": 1510,
    "stack_size": 200,
    "description": "Studying the probability oscillation in time with the Rabi frequency as the particle wave function evolves makes it possible to artificially interfere with it during a quantum jump to steer the quantum in the desired direction."
  },
  {
    "item_id": 1305,
    "name": "Quantum Chip",
    "type": "COMPONENT",
    "grid_index": 1511,
    "stack_size": 200,
    "description": "With robust computing power and ultra-fast computation, it can predict if a quantum jump would cause an error and prevent it by promptly reversing a jump process that may result in an error."
  },
  {
    "item_id": 1401,
    "name": "Plasma Exciter",
    "type": "COMPONENT",
    "grid_index": 1502,
    "stack_size": 200,
    "description": "The plasma generated by the high-power Plasma Exciter can be used to extract and refine crude oil or create wireless power towers for remote power transmission and charging the mecha."
  },
  {
    "item_id": 1402,
    "name": "Particle Broadband",
    "type": "COMPONENT",
    "grid_index": 1411,
    "stack_size": 200,
    "description": "Controlling the particles so that they maintain a certain regularity significantly increases the printing speed of the particles."
  },
  {
    "item_id": 1403,
    "name": "Annihilation Constraint Sphere",
    "type": "COMPONENT",
    "grid_index": 1311,
    "stack_size": 20,
    "description": "Confining the annihilation reaction within the sphere to obtain a stable and controlled energy output is a key component of Artificial Stars."
  },
  {
    "item_id": 1404,
    "name": "Photon Combiner",
    "type": "COMPONENT",
    "grid_index": 1503,
    "stack_size": 200,
    "description": "The prism surface is cut into nano-gratings and then reassembled so that a single high-energy photon is emitted after continuously absorbing multiple low-energy photons in a specific combination of structures. Amazingly, the natural Grating Crystals within the cluster can accomplish this directly."
  },
  {
    "item_id": 1405,
    "name": "Thruster",
    "type": "COMPONENT",
    "grid_index": 1602,
    "stack_size": 200,
    "description": "It can supply power to the Logistics Drones."
  },
  {
    "item_id": 1406,
    "name": "Reinforced Thruster",
    "type": "COMPONENT",
    "grid_index": 1603,
    "stack_size": 100,
    "description": "It is an upgraded version of the thruster that can power the Logistics Vessel."
  },
  {
    "item_id": 1407,
    "name": "Engine",
    "type": "COMPONENT",
    "grid_index": 1601,
    "stack_size": 200,
    "description": "A small aerodynamic component, used as basic part in many aircrafts. This engine can be crafted easily from cheap raw materials."
  },
  {
    "item_id": 1501,
    "name": "Solar Sail",
    "type": "PRODUCT",
    "grid_index": 1708,
    "stack_size": 200,
    "description": "The EM-Rail Ejector can launch large numbers of Solar Sails to create a Dyson Swarm, enabling more efficient radiant energy acquisition from a star."
  },
  {
    "item_id": 1502,
    "name": "Dyson Sphere Component",
    "type": "COMPONENT",
    "grid_index": 1710,
    "stack_size": 100,
    "description": "Small Carrier Rockets can transport the components to the planned Dyson Sphere, where they will form the Dyson Sphere’s Nodes and Frames."
  },
  {
    "item_id": 1503,
    "name": "Small Carrier Rocket",
    "type": "PRODUCT",
    "grid_index": 1711,
    "stack_size": 20,
    "description": "The delivery vehicle for Dyson Sphere Components. More rockets should be launched if a Dyson Sphere needs to be built faster."
  },
  {
    "item_id": 1601,
    "name": "Magnum Ammo Box",
    "type": "PRODUCT",
    "grid_index": 1312,
    "stack_size": 100,
    "description": "Magnum ammo crafted from copper ingots at low cost. Copper is self-lubricating, so it can maintain its shape and still reduce the risks of deformation and fracturing when shooting. An ammo box contains 30 bullets."
  },
  {
    "item_id": 1602,
    "name": "Titanium Ammo Box",
    "type": "PRODUCT",
    "grid_index": 1412,
    "stack_size": 100,
    "description": "Magnum Ammo Boxes improved with titanium ingots. Now their sharper warheads can pierce Dark Fog's armor easily. An ammo box contains 30 bullets."
  },
  {
    "item_id": 1603,
    "name": "Superalloy Ammo Box",
    "type": "PRODUCT",
    "grid_index": 1512,
    "stack_size": 100,
    "description": "Magnum Ammo Boxs enhanced with titanium alloy. The shape and structure of their cases are modified based on a lightweight titanium alloy, resulting in a higher initial speed, stabler flight capability, and greater power. An ammo box contains 30 bullets."
  },
  {
    "item_id": 1604,
    "name": "Shell Set",
    "type": "PRODUCT",
    "grid_index": 1513,
    "stack_size": 100,
    "description": "Basic shells contain efficient Combustible Units. Once shot to a target position, they will explode immediately and inflict Kinetic and Explosive Damage in the area. A Shell Set contains 12 shells."
  },
  {
    "item_id": 1605,
    "name": "High-Explosive Shell Set",
    "type": "PRODUCT",
    "grid_index": 1613,
    "stack_size": 100,
    "description": "Advanced high-energy Explosive Unit technology powerfully enhances shells. A Shell Set contains 12 shells."
  },
  {
    "item_id": 1606,
    "name": "Crystal Shell Set",
    "type": "PRODUCT",
    "grid_index": 1713,
    "stack_size": 100,
    "description": "Crystal Explosive Units release greater energy with a more powerful smashing effect, inflicting considerable damage to even the toughest enemy units. A Shell Set contains 12 shells."
  },
  {
    "item_id": 1607,
    "name": "Plasma Capsule",
    "type": "PRODUCT",
    "grid_index": 1612,
    "stack_size": 100,
    "description": "Filled with deuterium that, when stimulated by a Plasma Turret, can transform into a high-temperature plasmoid to effectively damage space targets. Each capsule can be stimulated 10 times."
  },
  {
    "item_id": 1608,
    "name": "Antimatter Capsule",
    "type": "PRODUCT",
    "grid_index": 1712,
    "stack_size": 100,
    "description": "The ultimate energy weapon that was once prohibited by COSMO. The target is destroyed instantly due to the enormous amount of energy generated from the annihilation reaction as matter and antimatter collide. Each capsule can be stimulated 10 times."
  },
  {
    "item_id": 1609,
    "name": "Missile Set",
    "type": "PRODUCT",
    "grid_index": 1213,
    "stack_size": 100,
    "description": "The target identification system on the head can adjust its attack trajectory in real time during flight to hit targets. A Missile Set contains 24 missiles."
  },
  {
    "item_id": 1610,
    "name": "Supersonic Missile Set",
    "type": "PRODUCT",
    "grid_index": 1313,
    "stack_size": 100,
    "description": "The thruster's dynamism massively accelerates the missile beyond the speed of sound and the upgraded warhead and payload recipe increases the damage. A Missile Set contains 24 missiles."
  },
  {
    "item_id": 1611,
    "name": "Gravity Missile Set",
    "type": "PRODUCT",
    "grid_index": 1413,
    "stack_size": 100,
    "description": "Strange Matter's negative gravitational pressure is used to warp the surrounding space, thus increasing missile speed. The warping space increases explosive damage. A Missile Set contains 24 missiles."
  },
  {
    "item_id": 1612,
    "name": "Jamming Capsule",
    "type": "PRODUCT",
    "grid_index": 1812,
    "stack_size": 100,
    "description": "A Jammer Tower can interfere with the enemies within the range by consuming Jamming Capsule, reducing their movement speed and rate of fire. Each Jamming Capsule can interfere with 60 units."
  },
  {
    "item_id": 1613,
    "name": "Suppressing Capsule",
    "type": "PRODUCT",
    "grid_index": 1813,
    "stack_size": 100,
    "description": "Suppressing Capsule can slow down even suppress enemies. Each Suppressing Capsule can interfere with 60 units. "
  },
  {
    "item_id": 1801,
    "name": "Hydrogen Fuel Rod",
    "type": "PRODUCT",
    "grid_index": 1209,
    "stack_size": 30,
    "energy": 54000000,
    "fuel_chamber_boost": 2.0,
    "description": "Due to the improvement of cryogenic technology, gaseous hydrogen can condense itself into a fluid to make liquid hydrogen fuel rods with a higher combustion efficiency. Using it as a fuel for the mecha can dramatically improve its combustion output."
  },
  {
    "item_id": 1802,
    "name": "Deuteron Fuel Rod",
    "type": "PRODUCT",
    "grid_index": 1210,
    "stack_size": 30,
    "energy": 600000000,
    "fuel_chamber_boost": 3.0,
    "description": "Under a magnetic field, deuterium can be made into deuteron fuel rods that can yield more powerful energy. These can be used as a fuel source for small fusion systems."
  },
  {
    "item_id": 1803,
    "name": "Antimatter Fuel Rod",
    "type": "PRODUCT",
    "grid_index": 1211,
    "stack_size": 30,
    "energy": 7200000000,
    "fuel_chamber_boost": 5.0,
    "description": "The Annihilation Constraint Sphere’s strong restraints act on Antimatter to form a more stable fuel rod. This powerful energy is then safer to harness."
  },
  {
    "item_id": 1804,
    "name": "Strange Annihilation Fuel Rod",
    "type": "PRODUCT",
    "grid_index": 1212,
    "stack_size": 50,
    "energy": 72000000000,
    "fuel_chamber_boost": 11.0,
    "description": "If Strange Matter is used as the main raw material for the annihilation reaction, both the energy density and the output power will rise significantly."
  },
  {
    "item_id": 2001,
    "name": "Conveyor Belt MK.I",
    "type": "LOGISTICS",
    "grid_index": 2201,
    "stack_size": 300,
    "sub_id": 1,
    "can_build": true,
    "build_index": 301,
    "description": "We need automation! Conveyor Belts are the most basic components of automated production. They can transport cargo from one location to another."
  },
  {
    "item_id": 2002,
    "name": "Conveyor Belt MK.II",
    "type": "LOGISTICS",
    "grid_index": 2202,
    "stack_size": 300,
    "sub_id": 2,
    "can_build": true,
    "build_index": 302,
    "description": "This Conveyor Belt type allows for faster cargo transportation and has higher throughput."
  },
  {
    "item_id": 2003,
    "name": "Conveyor Belt MK.III",
    "type": "LOGISTICS",
    "grid_index": 2203,
    "stack_size": 300,
    "sub_id": 3,
    "can_build": true,
    "build_index": 303,
    "description": "It can maximize the speed and throughput of transported cargo."
  },
  {
    "item_id": 2011,
    "name": "Sorter MK.I",
    "type": "LOGISTICS",
    "grid_index": 2301,
    "stack_size": 200,
    "sub_id": 1,
    "can_build": true,
    "build_index": 304,
    "description": "It can transport cargo into a facility via Conveyor Belts, or between facilities. Filters can be configured to filter the cargo."
  },
  {
    "item_id": 2012,
    "name": "Sorter MK.II",
    "type": "LOGISTICS",
    "grid_index": 2302,
    "stack_size": 200,
    "sub_id": 2,
    "can_build": true,
    "build_index": 305,
    "description": "It enables faster cargo picking and sorting."
  },
  {
    "item_id": 2013,
    "name": "Sorter MK.III",
    "type": "LOGISTICS",
    "grid_index": 2303,
    "stack_size": 200,
    "sub_id": 3,
    "can_build": true,
    "build_index": 306,
    "description": "It can maximize cargo sorting speed. A Sorter Mk.III at maximum cycle speed can satisfy a Conveyor Belt."
  },
  {
    "item_id": 2014,
    "name": "Pile Sorter",
    "type": "LOGISTICS",
    "grid_index": 2304,
    "stack_size": 200,
    "sub_id": 4,
    "can_build": true,
    "build_index": 307,
    "description": "After upgrading it, the Pile Sorter can integrate multiple cargos into one and feed out it. Even it is slightly expensive but it is a good deal for those engineers who are dedicated to run the Conveyor Belt at full speed."
  },
  {
    "item_id": 2020,
    "name": "Splitter",
    "type": "LOGISTICS",
    "grid_index": 2204,
    "stack_size": 50,
    "can_build": true,
    "build_index": 308,
    "description": "It is designed to distribute cargo to different Conveyor Belts or balance out multiple Conveyor Belts. Filters and infeed/outfeed priority can be set on any port."
  },
  {
    "item_id": 2030,
    "name": "Traffic Monitor",
    "type": "LOGISTICS",
    "grid_index": 2206,
    "stack_size": 100,
    "can_build": true,
    "build_index": 309,
    "description": "Building a Flow Meter on a Conveyor Belt monitors the real-time flow rate at a corresponding location on the belt. Criteria can be specified to trigger an alarm."
  },
  {
    "item_id": 2040,
    "name": "Automatic Piler",
    "type": "LOGISTICS",
    "grid_index": 2205,
    "stack_size": 50,
    "can_build": true,
    "build_index": 602,
    "description": "Building an Auto-piler on a Conveyor Belt automatically merges two cargoes on the belt into one, which significantly enhances the belt's carrying capacity."
  },
  {
    "item_id": 2101,
    "name": "Depot MK.I",
    "type": "LOGISTICS",
    "grid_index": 2208,
    "stack_size": 50,
    "sub_id": 1,
    "can_build": true,
    "build_index": 401,
    "description": "Storage space for products, although its capacity is limited."
  },
  {
    "item_id": 2102,
    "name": "Depot MK.II",
    "type": "LOGISTICS",
    "grid_index": 2209,
    "stack_size": 50,
    "sub_id": 2,
    "can_build": true,
    "build_index": 402,
    "description": "It has double the capacity of a Depot Mk.I, but requires steel to produce."
  },
  {
    "item_id": 2103,
    "name": "Planetary Logistics Station",
    "type": "LOGISTICS",
    "grid_index": 2212,
    "stack_size": 10,
    "can_build": true,
    "build_index": 603,
    "description": "It is the hub of the planetary logistics system. Logistics Drones will automatically deliver the cargo to the respective stations once you have specified the supply/demand requirements.&lt;br /&gt;(Transportation is limited to its own planet)"
  },
  {
    "item_id": 2104,
    "name": "Interstellar Logistics Station",
    "type": "LOGISTICS",
    "grid_index": 2213,
    "stack_size": 10,
    "can_build": true,
    "build_index": 604,
    "description": "Giant space elevators make it easier to transport materials between planets. They can connect factories on different planets to form a massive industrial empire."
  },
  {
    "item_id": 2105,
    "name": "Orbital Collector",
    "type": "LOGISTICS",
    "grid_index": 2214,
    "stack_size": 10,
    "can_build": true,
    "build_index": 605,
    "description": "It is used to collect resources from gas giants. It needs to consume the collected fuel materials to power the collector to work in orbit."
  },
  {
    "item_id": 2106,
    "name": "Storage Tank",
    "type": "LOGISTICS",
    "grid_index": 2210,
    "stack_size": 50,
    "can_build": true,
    "build_index": 403,
    "description": "Storage Tank has a larger capacity for containing fluids than a Depot. Dismantling a tank will destroy the fluid stored within."
  },
  {
    "item_id": 2107,
    "name": "Logistics Distributor",
    "type": "LOGISTICS",
    "grid_index": 2211,
    "stack_size": 50,
    "can_build": true,
    "build_index": 601,
    "description": "After the Logistics Distributor is installed on the top floor of a Depot, the Logistics Bot will automatically deliver the Depot's contents to Icarus' Inventory or other Logistics Distributors. This greatly helps Icarus to access various items in a short distance."
  },
  {
    "item_id": 2201,
    "name": "Tesla Tower",
    "type": "LOGISTICS",
    "grid_index": 2101,
    "stack_size": 100,
    "sub_id": 1,
    "can_build": true,
    "build_index": 101,
    "description": "It is a power transmission facility with a particular connection length and coverage that can extend the supply range of the Power Grid."
  },
  {
    "item_id": 2202,
    "name": "Wireless Power Tower",
    "type": "LOGISTICS",
    "grid_index": 2102,
    "stack_size": 100,
    "sub_id": 2,
    "can_build": true,
    "build_index": 102,
    "description": "It is a remote power transmission facility that can draw electricity from the Power Grid and charge the mecha."
  },
  {
    "item_id": 2203,
    "name": "Wind Turbine",
    "type": "PRODUCTION",
    "grid_index": 2104,
    "stack_size": 50,
    "sub_id": 4,
    "can_build": true,
    "build_index": 104,
    "description": "It is a primary power generator that converts wind energy into electrical energy. The actual power generation performance depends on the planet’s wind energy utilization."
  },
  {
    "item_id": 2204,
    "name": "Thermal Power Plant",
    "type": "PRODUCTION",
    "grid_index": 2105,
    "stack_size": 50,
    "sub_id": 5,
    "can_build": true,
    "build_index": 105,
    "description": "It is a facility that generates electricity using combustible materials, such as coal, as fuel. The energy output to heat generation ratio depends on the fuel consumption."
  },
  {
    "item_id": 2205,
    "name": "Solar Panel",
    "type": "PRODUCTION",
    "grid_index": 2106,
    "stack_size": 50,
    "sub_id": 7,
    "can_build": true,
    "build_index": 106,
    "description": "It generates electricity from sunlight. The actual power generation performance is linked with the planet’s light energy utilization. Stops running at night. Accumulators can be used to store surplus electricity during the day."
  },
  {
    "item_id": 2206,
    "name": "Accumulator",
    "type": "LOGISTICS",
    "grid_index": 2110,
    "stack_size": 50,
    "sub_id": 8,
    "can_build": true,
    "build_index": 109,
    "description": "It is an electric power storage device. When surplus power is available in the Power Grid, excess power will be automatically stored. When the power supply is insufficient, stored power will be automatically released to operate the facility."
  },
  {
    "item_id": 2207,
    "name": "Accumulator (Full)",
    "type": "LOGISTICS",
    "grid_index": 2111,
    "stack_size": 50,
    "sub_id": 8,
    "can_build": true,
    "energy": 540000000,
    "fuel_chamber_boost": 1.0,
    "unlock_key": 2206,
    "explicit_tech_dep": 1511,
    "explicit_produce_from": "Energy Exchanger",
    "description": "It is an Accumulator with full charge. It can either be used as a facility to automatically release power when the power is insufficient, or it can be placed in an Energy Exchanger to release electricity."
  },
  {
    "item_id": 2208,
    "name": "Ray Receiver",
    "type": "PRODUCTION",
    "grid_index": 2112,
    "stack_size": 20,
    "sub_id": 9,
    "can_build": true,
    "build_index": 803,
    "description": "It receives high-energy rays transmitted from the Dyson Swarm or Dyson Sphere. The received energy can be transmitted directly to the Power Grid or stored as Critical Photons."
  },
  {
    "item_id": 2209,
    "name": "Energy Exchanger",
    "type": "LOGISTICS",
    "grid_index": 2109,
    "stack_size": 20,
    "sub_id": 10,
    "can_build": true,
    "build_index": 606,
    "description": "It is a facility that can convert electric power. It can either deposit surplus power from the Power Grid into an empty Accumulator to fully charge it, or release the power stored in a fully charged Accumulator."
  },
  {
    "item_id": 2210,
    "name": "Artificial Star",
    "type": "PRODUCTION",
    "grid_index": 2113,
    "stack_size": 20,
    "sub_id": 11,
    "can_build": true,
    "build_index": 805,
    "description": "\"Just allow the positive and negative proton beams to pass silently through the magnetic field from both ends into the Constraint Sphere, nice and easy!\" It is simple but effective and is called the Artificial Sun."
  },
  {
    "item_id": 2211,
    "name": "Mini Fusion Power Plant",
    "type": "PRODUCTION",
    "grid_index": 2108,
    "stack_size": 50,
    "sub_id": 6,
    "can_build": true,
    "build_index": 108,
    "description": "Under the effect of a high-intensity, high-density magnetic field, this facility can turn the enormous energy emitted by Deuteron Fuel Rods via a controlled fusion reaction into electricity."
  },
  {
    "item_id": 2212,
    "name": "Satellite Substation",
    "type": "LOGISTICS",
    "grid_index": 2103,
    "stack_size": 30,
    "sub_id": 3,
    "can_build": true,
    "build_index": 103,
    "description": "It is a wide-area distribution facility capable of transmitting power over a longer range, thereby enabling broader coverage."
  },
  {
    "item_id": 2213,
    "name": "Geothermal Power Station",
    "type": "PRODUCTION",
    "grid_index": 2107,
    "stack_size": 50,
    "sub_id": 12,
    "can_build": true,
    "build_index": 107,
    "description": "It is a power generation facility fueled by magma, where multiple successive low-energy photons are merged into a single high-energy photon and the energy is steadily transmitted to the Power Grid. The generation output directly correlates to the concentration of magma."
  },
  {
    "item_id": 2301,
    "name": "Mining Machine",
    "type": "PRODUCTION",
    "grid_index": 2305,
    "stack_size": 50,
    "sub_id": 1,
    "can_build": true,
    "build_index": 201,
    "description": "The more ore veins covered by a Mining Machine, the faster the extraction speed. Multiple Mining Rings can cover the same vein, but the more Mining Rings covering a vein, the faster the loss."
  },
  {
    "item_id": 2302,
    "name": "Arc Smelter",
    "type": "PRODUCTION",
    "grid_index": 2401,
    "stack_size": 50,
    "can_build": true,
    "build_index": 501,
    "description": "It smelts ores and metals at high temperatures generated by the electrode arc and is also useful for purification and crystal smelting."
  },
  {
    "item_id": 2303,
    "name": "Assembling Machine Mk.I",
    "type": "PRODUCTION",
    "grid_index": 2404,
    "stack_size": 50,
    "can_build": true,
    "build_index": 503,
    "description": "The basic assembler can transform primary items such as iron and copper ingots into more advanced products."
  },
  {
    "item_id": 2304,
    "name": "Assembling Machine Mk.II",
    "type": "PRODUCTION",
    "grid_index": 2405,
    "stack_size": 50,
    "can_build": true,
    "build_index": 504,
    "description": "With significantly improved production speed, items can be produced more quickly."
  },
  {
    "item_id": 2305,
    "name": "Assembling Machine Mk.III",
    "type": "PRODUCTION",
    "grid_index": 2406,
    "stack_size": 50,
    "can_build": true,
    "build_index": 505,
    "description": "It maximizes the production speed. Conveyor Belts and Sorters of different speeds can be combined to avoid empty assemblers or product overflow."
  },
  {
    "item_id": 2306,
    "name": "Water Pump",
    "type": "PRODUCTION",
    "grid_index": 2307,
    "stack_size": 30,
    "can_build": true,
    "build_index": 203,
    "description": "It is a facility that pumps liquids directly from oceans, including the sulfuric acid ocean."
  },
  {
    "item_id": 2307,
    "name": "Oil Extractor",
    "type": "PRODUCTION",
    "grid_index": 2308,
    "stack_size": 20,
    "can_build": true,
    "build_index": 204,
    "description": "It uses focusing plasma to extract crude oil from oil seeps. The extraction speed is dependent on the yield of the oil seep and the level of Resource Utilization."
  },
  {
    "item_id": 2308,
    "name": "Oil Refinery",
    "type": "PRODUCTION",
    "grid_index": 2309,
    "stack_size": 30,
    "can_build": true,
    "build_index": 506,
    "description": "Refined oil and hydrogen are obtained by further refining extracted crude oil."
  },
  {
    "item_id": 2309,
    "name": "Chemical Plant",
    "type": "PRODUCTION",
    "grid_index": 2311,
    "stack_size": 30,
    "can_build": true,
    "build_index": 508,
    "description": "It is a chemical production facility that can process the primary products of crude oil into more advanced chemical products."
  },
  {
    "item_id": 2310,
    "name": "Miniature Particle Collider",
    "type": "PRODUCTION",
    "grid_index": 2313,
    "stack_size": 20,
    "can_build": true,
    "build_index": 510,
    "description": "New particles can be produced when two streams of accelerated particles, upon reaching a certain intensity and energy, collide. It is usually employed to create stable deuterium and antimatter, but consumes considerable energy."
  },
  {
    "item_id": 2311,
    "name": "EM-Rail Ejector",
    "type": "PRODUCTION",
    "grid_index": 2410,
    "stack_size": 30,
    "can_build": true,
    "build_index": 802,
    "description": "It ejects considerable Solar Sails to integrate with the Dyson Swarm."
  },
  {
    "item_id": 2312,
    "name": "Vertical Launching Silo",
    "type": "PRODUCTION",
    "grid_index": 2411,
    "stack_size": 10,
    "can_build": true,
    "build_index": 804,
    "description": "It launches Small Carrier Rockets carrying components into the Dyson Sphere orbit to form Nodes and Frames."
  },
  {
    "item_id": 2313,
    "name": "Spray Coater",
    "type": "PRODUCTION",
    "grid_index": 2207,
    "stack_size": 50,
    "can_build": true,
    "build_index": 310,
    "description": "Fitting the Spray Coater to a Conveyor Belt and feeding it to the Proliferator through the upper port allows cargo on the Conveyor Belt to be sprayed. Production is either accelerated or extra products gained when cargo sprayed with the Proliferator is used as raw material to create next-level products."
  },
  {
    "item_id": 2314,
    "name": "Fractionator",
    "type": "PRODUCTION",
    "grid_index": 2310,
    "stack_size": 30,
    "can_build": true,
    "build_index": 507,
    "description": "Deuterium can be fractionated from liquid hydrogen efficiently by utilizing the high vapor pressure ratio of liquid hydrogen to liquid deuterium at a certain temperature. A Conveyor Belt is used to import hydrogen from one side. After fractionation, the hydrogen will be exported from the other side, and the fractionated deuterium will be exported from the front port."
  },
  {
    "item_id": 2315,
    "name": "Plane Smelter",
    "type": "PRODUCTION",
    "grid_index": 2402,
    "stack_size": 50,
    "can_build": true,
    "build_index": 502,
    "description": "When magnetic monopoles travel through the Plane Filter, they generate quantum effects, which can produce thermodynamic negative temperature flow. Ores can be smelted or purified at accelerated rates using this principle."
  },
  {
    "item_id": 2316,
    "name": "Advanced Mining Machine",
    "type": "PRODUCTION",
    "grid_index": 2306,
    "stack_size": 30,
    "sub_id": 2,
    "can_build": true,
    "build_index": 202,
    "description": "The Quantum Chip is used to manipulate the photon groups generated by the Exciter during the quantum jump process, causing the laser beam to focus intensely. The focused laser beam rapidly heats the ore veins along a predetermined path in a special gravitational field. If ores are transported and contained in particle form, building is easier and ores are collected faster. The collected ores can be shipped out by Conveyor Belts or Logistics Drones."
  },
  {
    "item_id": 2317,
    "name": "Quantum Chemical Plant",
    "type": "PRODUCTION",
    "grid_index": 2312,
    "stack_size": 30,
    "can_build": true,
    "build_index": 509,
    "description": "Quantum entanglement formed via Strange Matter at specific points could decouple the most complicated part of the chaos phenomenon in chemical reactions. This may lead the reactions toward a predetermined direction. If these magic points could evolve, they could catalyze the corresponding chemical reactions."
  },
  {
    "item_id": 2318,
    "name": "Re-Composing Assembler",
    "type": "PRODUCTION",
    "grid_index": 2407,
    "stack_size": 50,
    "can_build": true,
    "build_index": 808,
    "description": "The AI module can analyze the recipe of an item in real time and decompose raw materials into particles by precisely controlling the structure and compound mode of molecules. After that, it then re-composes particles to form required items and performs Quantum Printing, greatly improving manufacturing speed."
  },
  {
    "item_id": 2319,
    "name": "Negentropy Smelter",
    "type": "PRODUCTION",
    "grid_index": 2403,
    "stack_size": 50,
    "can_build": true,
    "build_index": 807,
    "description": "After energy has been put in continuously, the stimulated negentropy singularity in the Smelter can steadily give off negentropy. Despite the fact that little negentropy is obtained, after being repeated and repeated the process can efficiently restore ores to their elemental states from impure ones."
  },
  {
    "item_id": 2901,
    "name": "Matrix Lab",
    "type": "PRODUCTION",
    "grid_index": 2408,
    "stack_size": 50,
    "can_build": true,
    "build_index": 801,
    "description": "It is a type of connector for the CentreBrain, which can either produce matrices or conduct research. The more Matrix Labs, the faster the production and research speeds."
  },
  {
    "item_id": 2902,
    "name": "Self-Evolution Lab",
    "type": "PRODUCTION",
    "grid_index": 2409,
    "stack_size": 50,
    "can_build": true,
    "build_index": 806,
    "description": "A Self-evolution Lab allows silicon-based neurons to autonomously adjust and improve neural networking while constantly learning and adapting, similar to the synaptic plasticity of biological neurons. Over time, silicon-based neurons can keep optimizing their own structures and function through self-evolution to solve problems more effectively."
  },
  {
    "item_id": 3001,
    "name": "Gauss Turret",
    "type": "TURRET",
    "grid_index": 2501,
    "stack_size": 50,
    "can_build": true,
    "build_index": 701,
    "description": "An EM field is used to accelerate bullet speed. 48mm bullets form dense and intense firepower. The damage inflicted to low-air units as a result should not be underestimated."
  },
  {
    "item_id": 3002,
    "name": "Laser Turret",
    "type": "TURRET",
    "grid_index": 2504,
    "stack_size": 50,
    "can_build": true,
    "build_index": 704,
    "description": "High-energy laser beams will be emitted to keep strafing enemy units when they enter the defensive range. High temperatures lead to sustained damage to targets. Laser Towers' high-frequency lasers can hit targets precisely and in a short period of time, but they consume a lot of energy."
  },
  {
    "item_id": 3003,
    "name": "Implosion Cannon",
    "type": "TURRET",
    "grid_index": 2503,
    "stack_size": 50,
    "can_build": true,
    "build_index": 703,
    "description": "After hitting a target, a 280mm shell can cause a wide-ranging explosive blast and inflict Explosive Damage to units and facilities in the vicinity. Additionally, due to its design characteristics Implosion Cannon can't be used to attack close targets."
  },
  {
    "item_id": 3004,
    "name": "Plasma Turret",
    "type": "TURRET",
    "grid_index": 2505,
    "stack_size": 50,
    "can_build": true,
    "build_index": 705,
    "description": "After being stimulated, the matter inside an energy capsule will be in a high-energy plasma state. It will then be quickly emitted by the Plasma Turret's accelerator to generate high-speed plasma beams. Such beams are extremely penetrating and destructive, and can effectively destroy space targets."
  },
  {
    "item_id": 3005,
    "name": "Missile Turret",
    "type": "TURRET",
    "grid_index": 2502,
    "stack_size": 50,
    "can_build": true,
    "build_index": 702,
    "description": "Equipped with an advanced missile launcher and a target identification system, Turrets can quickly identify and locate both ground and space targets. Once they lock onto a target, they will then launch missiles. They are designed to respond to multiple threats with all-around defense."
  },
  {
    "item_id": 3006,
    "name": "Jammer Tower",
    "type": "TURRET",
    "grid_index": 2508,
    "stack_size": 50,
    "can_build": true,
    "build_index": 708,
    "description": "It can interfere with nearby enemy units periodically, decreasing their movement speed and rate of fire. Each interference consumes EM capsule once. "
  },
  {
    "item_id": 3007,
    "name": "Signal Tower",
    "type": "DEFENSE",
    "grid_index": 2509,
    "stack_size": 20,
    "can_build": true,
    "build_index": 709,
    "description": "A tactical defensive facility that periodically sends out signals at a specific frequency to induce Dark Fog, change the direction of an attack and increase the unit assembling speed. Signal Towers can form a data chain with Missile Turrets for information sharing, thus expanding the attack range of Missile Turrets."
  },
  {
    "item_id": 3008,
    "name": "Planetary Shield Generator",
    "type": "DEFENSE",
    "grid_index": 2510,
    "stack_size": 20,
    "can_build": true,
    "build_index": 710,
    "description": "They can create Planetary Shields on planets to resist attacks from space. Massive amounts of energy are required for a Planetary Shield. If the shield becomes ineffective, it will leave the planet exposed to serious threats from space. Additionally, the number of Shield Generators that can be built on a planet is limited.&lt;br /&gt;Planetary Shield can only resist damage from space, it cannot defend ground damage."
  },
  {
    "item_id": 3009,
    "name": "Battlefield Analysis Base",
    "type": "DEFENSE",
    "grid_index": 2507,
    "stack_size": 20,
    "can_build": true,
    "build_index": 707,
    "description": "The core for battlefield controlling with powerful real-time battlefield analysis and command capabilities. Self-equipped Fighters can be dispatched for base defense. A destroyed building will automatically be marked with a hologram. Construction Drones will then be dispatched for building and repair to provide support on the battlefield. A Battlefield Analysis Base can also collect enemy debris for analysis and acquire useful intelligence and resources from battlefield residues."
  },
  {
    "item_id": 3010,
    "name": "SR Plasma Turret",
    "type": "TURRET",
    "grid_index": 2506,
    "stack_size": 20,
    "can_build": true,
    "build_index": 706,
    "description": "The powerful high-temperature plasma can melt enemies within its range, but maintaining such a device on the ground is not easy. To be able to attack nearby targets, constantly maintaining the excited plasma makes this facility very fragile and requires a large amount of power."
  },
  {
    "item_id": 5001,
    "name": "Logistics Drone",
    "type": "LOGISTICS",
    "grid_index": 1702,
    "stack_size": 200,
    "description": "It functions to dynamically balance the supply and demand of items in the planetary logistics system. It only works with the Logistics Station it comes from."
  },
  {
    "item_id": 5002,
    "name": "Interstellar Logistics Vessel",
    "type": "LOGISTICS",
    "grid_index": 1703,
    "stack_size": 50,
    "description": "It functions to actively balance the supply and demand of items between planets. Consuming Space Warpers can enable Logistics Vessels to launch warp flights."
  },
  {
    "item_id": 5003,
    "name": "Logistics Bot",
    "type": "LOGISTICS",
    "grid_index": 1701,
    "stack_size": 200,
    "description": "It actively balances the supply and demand of items in the distribution logistics system, but it will not deliver to destinations beyond the distribution scope."
  },
  {
    "item_id": 5101,
    "name": "Prototype",
    "type": "PRODUCT",
    "grid_index": 1607,
    "stack_size": 100,
    "description": "Ground forces, prototypes of Combat Drones, that can assist Icarus in fights on planet surfaces. Though simple and crude, it represents a decent start. You can get a better Combat Drone by modifying and upgrading the prototype.&lt;br /&gt;&lt;br /&gt;Note: Ground fighters cannot be deployed in space!"
  },
  {
    "item_id": 5102,
    "name": "Precision Drone",
    "type": "PRODUCT",
    "grid_index": 1608,
    "stack_size": 100,
    "description": "Ground forces, which can assist Icarus in fights on planet surfaces. Based on a prototype and with a built-in Photon Combiner, it can continuously absorb low-energy photons and convert them to high-energy ones. This type of laser weapon can accurately hit and damage targets without needing to be near them. It is suitable for assaulting distant enemy units.&lt;br /&gt;&lt;br /&gt;Note: Ground fighters cannot be deployed in space!"
  },
  {
    "item_id": 5103,
    "name": "Attack Drone",
    "type": "PRODUCT",
    "grid_index": 1609,
    "stack_size": 100,
    "description": "Ground forces, which can assist Icarus in fights on planet surfaces. Based on a prototype and with a stronger, built-in EM weapon system, it can only attack close targets. You can enhance its survival capabilities by upgrading its armor.&lt;br /&gt;&lt;br /&gt;Note: Ground fighters cannot be deployed in space!"
  },
  {
    "item_id": 5111,
    "name": "Corvette",
    "type": "PRODUCT",
    "grid_index": 1610,
    "stack_size": 50,
    "description": "Space forces, which consist of small vessels, that can assist Icarus in fights in space and hit distant targets."
  },
  {
    "item_id": 5112,
    "name": "Destroyer",
    "type": "PRODUCT",
    "grid_index": 1611,
    "stack_size": 50,
    "description": "Space forces which consist of medium Warships. Destroyers are larger and more aggressive. They are used to attack enemy units nearby and exert a more suppressive and destructive effect. It costs 4 Command Pts to command a Destroyer. This means a Space Fleet can only have a maximum of 3 Destroyers at a time."
  },
  {
    "item_id": 5201,
    "name": "Dark Fog Matrix",
    "type": "DARK_FOG",
    "grid_index": 1807,
    "stack_size": 200,
    "unlock_key": -2,
    "mining_from": "Dark Fog Debris",
    "description": "A mystery substance collected from Dark Fog Debris. Deep scanning reveals that this substance has a topological structure that we have never seen before. Vaguely familiar yet also different, it appears to contain unusual information. We might be able to obtain something different by solving the mystery that surrounds it."
  },
  {
    "item_id": 5202,
    "name": "Silicon-Based Neuron",
    "type": "DARK_FOG",
    "grid_index": 1809,
    "stack_size": 100,
    "unlock_key": -2,
    "mining_from": "Dark Fog Debris",
    "description": "Obtained from Dark Fog Debris. These silicon-based neurons have both storage and computing capabilities. When several silicon-based neurons are combined, they can simulate the brain operation of a carbon-based life form."
  },
  {
    "item_id": 5203,
    "name": "Matter Recombinator",
    "type": "DARK_FOG",
    "grid_index": 1811,
    "stack_size": 100,
    "unlock_key": -2,
    "mining_from": "Dark Fog Debris",
    "description": "Obtained from Dark Fog Debris. Research reveals that this substance has powerful decomposing and re-composing capabilities. It can instantly decompose matter into particles, and then re-compose these particles as designed to generate a different type of matter.&lt;br /&gt;"
  },
  {
    "item_id": 5204,
    "name": "Negentropy Singularity",
    "type": "DARK_FOG",
    "grid_index": 1810,
    "stack_size": 50,
    "unlock_key": -2,
    "mining_from": "Dark Fog Debris",
    "description": "Initial experiments hadn't identified any special properties of the substance. Yet when we keep inputting energy, it spontaneously shows weak negentropy."
  },
  {
    "item_id": 5205,
    "name": "Core Element",
    "type": "DARK_FOG",
    "grid_index": 1112,
    "stack_size": 50,
    "unlock_key": -2,
    "mining_from": "Dark Fog Debris",
    "description": "A Core Element is a novel type of matter which can be found in the debris of advanced Dark Fog. It has been discovered in experiments that a Core Element can efficiently and spontaneously combine itself with other types of matter, but it can't be singularized by Strange Matter. Therefore, adding a Core Element to the singularization reaction of Strange Matter can slow down that reaction and make it more orderly."
  },
  {
    "item_id": 5206,
    "name": "Energy Shard",
    "type": "DARK_FOG",
    "grid_index": 1808,
    "stack_size": 100,
    "energy": 3600000,
    "fuel_chamber_boost": 0.2,
    "unlock_key": -2,
    "mining_from": "Dark Fog Debris",
    "description": "A chemical fuel obtained from Dark Fog Debris. When providing energy to Icarus, its internal molecular stimulation mechanism can accelerate the speed of the Replicator."
  },
  {
    "item_id": 6001,
    "name": "Electromagnetic Matrix",
    "type": "MATRIX",
    "grid_index": 1801,
    "stack_size": 200,
    "description": "The foundation of all technological research as one of the five basic source codes for maintaining the CentreBrain simulation."
  },
  {
    "item_id": 6002,
    "name": "Energy Matrix",
    "type": "MATRIX",
    "grid_index": 1802,
    "stack_size": 200,
    "description": "The Energy Matrix is a major driver of further technological development as one of the five basic source codes for maintaining the CentreBrain simulation."
  },
  {
    "item_id": 6003,
    "name": "Structure Matrix",
    "type": "MATRIX",
    "grid_index": 1803,
    "stack_size": 200,
    "description": "Useful for obtaining new and improved structural materials as one of the five basic source codes for maintaining the CentreBrain simulation."
  },
  {
    "item_id": 6004,
    "name": "Information Matrix",
    "type": "MATRIX",
    "grid_index": 1804,
    "stack_size": 200,
    "description": "One of the five basic source codes for maintaining the CentreBrain simulation. The level of computerization significantly affects how well the Homebase operates."
  },
  {
    "item_id": 6005,
    "name": "Gravity Matrix",
    "type": "MATRIX",
    "grid_index": 1805,
    "stack_size": 200,
    "description": "One of the five basic source codes for maintaining the CentreBrain simulation. It finds a way to make quantum field theory and general relativity compatible."
  },
  {
    "item_id": 6006,
    "name": "Universe Matrix",
    "type": "MATRIX",
    "grid_index": 1806,
    "stack_size": 200,
    "description": "The triumphant, all-encompassing culmination of the theory of everything, revealing the ultimate secret of the universe!"
  }
]